openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
    /* Enable ADC. */
    Adc_ConfigureEQADC (ConfigPtr);

    /* Perform calibration of the ADC. */
    Adc_EQADCCalibrationSequence ();

    /* Configure DMA channels. */
    for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
    {
      /* ADC307. */
      ConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

      Dma_ConfigureChannel ((struct tcd_t *)ConfigPtr->groupConfigPtr [group].groupDMAResults, ConfigPtr->groupConfigPtr [group].dmaResultChannel);
      Dma_ConfigureChannel ((struct tcd_t *)ConfigPtr->groupConfigPtr [group].groupDMACommands, ConfigPtr->groupConfigPtr [group].dmaCommandChannel);
    }

    /* Start DMA channels. */
    for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
    {
      /* Invalidate queues. */
      EQADC.CFCR[group].B.CFINV = 1;

      Dma_StartChannel (ConfigPtr->groupConfigPtr [group].dmaResultChannel);
      Dma_StartChannel (ConfigPtr->groupConfigPtr [group].dmaCommandChannel);
    }

    Adc_ConfigureEQADCInterrupts ();

    /* Move on to INIT state. */
    adcState = ADC_INIT;
    returnValue = E_OK;
  }
  else
  {
    returnValue = E_NOT_OK;
  }

  return (returnValue);  
#endif  
}

Std_ReturnType Adc_SetupResultBuffer (Adc_GroupType group, Adc_ValueGroupType *bufferPtr)
{
  Std_ReturnType returnValue;

  /* Check for development errors. */
  if (E_OK == Adc_CheckSetupResultBuffer (group))
  {
    AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr = bufferPtr;
    
    returnValue = E_OK;
  }
  else
  {
    /* An error have been raised from Adc_CheckSetupResultBuffer(). */
    returnValue = E_NOT_OK;
  }

  return (returnValue);
}

#if (ADC_READ_GROUP_API == STD_ON)
Std_ReturnType Adc_ReadGroup (Adc_GroupType group, Adc_ValueGroupType *dataBufferPtr)
{
  Std_ReturnType returnValue;
  uint8_t channel;

  if (E_OK == Adc_CheckReadGroup (group))
  {
    if ((ADC_CONV_MODE_CONTINOUS == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
         ((ADC_STREAM_COMPLETED    == AdcConfigPtr->groupConfigPtr[group].status->groupStatus) ||
          (ADC_COMPLETED           == AdcConfigPtr->groupConfigPtr[group].status->groupStatus)))
    {
      /* ADC329, ADC331. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;
      returnValue = E_OK;
    }
    else if ((ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[group].conversionMode) &&
             (ADC_STREAM_COMPLETED  == AdcConfigPtr->groupConfigPtr[group].status->groupStatus))
    {
      /* ADC330. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

      returnValue = E_OK;
    }
    else
    {
      /* Keep status. */
      returnValue = E_OK;
    }

    if (E_OK == returnValue)
    {
      /* Copy the result to application buffer. */
#if defined(CFG_MPC5606S)

      for (channel = 0; channel < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; channel++)
  {
    if(ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[s_CurrGroupId].conversionMode)
    {
      dataBufferPtr[channel] = currResultBufPtr[channel];
    }
    else
    {
      if(ADC_ACCESS_MODE_SINGLE == AdcConfigPtr->groupConfigPtr[s_CurrGroupId].accessMode )
      {
        dataBufferPtr[channel] = currResultBufPtr[channel];
      }
      else
      {
        Adc_ValueGroupType *lastSamplePointer = currResultBufPtr;
        lastSamplePointer += (AdcConfigPtr->groupConfigPtr[group].numberOfChannels) * (s_CurrSampleCount % AdcConfigPtr->groupConfigPtr[group].streamNumSamples);
        dataBufferPtr[channel] = lastSamplePointer[channel];
	    }
    }
  }
        
#else

    for (channel = 0; channel < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; channel++)
    {
       dataBufferPtr[channel] = AdcConfigPtr->groupConfigPtr[group].resultBuffer[channel];
    }
#endif

    }
  }
  else
  {
    /* An error have been raised from Adc_CheckReadGroup(). */
    returnValue = E_NOT_OK;
  }

  return (returnValue);
}
#endif

Adc_StatusType Adc_GetGroupStatus (Adc_GroupType group)
{
  Adc_StatusType returnValue;
  if ((ADC_INIT == adcState) && (AdcConfigPtr != NULL))
  {
    /* Adc initilised, OK to move on... */
    returnValue = AdcConfigPtr->groupConfigPtr[group].status->groupStatus;
  }
  else
  {
    returnValue = ADC_IDLE;
#if ( ADC_DEV_ERROR_DETECT == STD_ON )
    Det_ReportError(MODULE_ID_ADC,0,ADC_GETGROUPSTATUS_ID, ADC_E_UNINIT );
#endif
    }

  return (returnValue);
}

#if defined(CFG_MPC5606S)
void Adc_Group0ConversionComplete (void)
{
	/* Clear ECH Flag and disable interruput */
	ADC_0.ISR.B.ECH = 1;
	ADC_0.IMR.B.MSKECH = 0;

	Adc_GroupDefType adcGroup = AdcConfigPtr->groupConfigPtr[s_CurrGroupId];
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
	/* Copy to result buffer */
	for(uint8 index=0; index < adcGroup.numberOfChannels; index++)
	{
		currResultBufPtr[index] = ADC_0.CDR[32+adcGroup.channelList[index]].B.CDATA;
	}
#endif
 
    if(ADC_CONV_MODE_ONESHOT == AdcConfigPtr->groupConfigPtr[s_CurrGroupId].conversionMode)
    {
    	adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;
    }
    else
    {
      if(ADC_ACCESS_MODE_SINGLE == adcGroup.accessMode )
      {
    	  adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;

        /* Disable trigger normal conversions for ADC0 */
        ADC_0.MCR.B.NSTART = 0;
      }
      else
      {
        if(ADC_STREAM_BUFFER_LINEAR == adcGroup.streamBufferMode)
        {
            s_CurrSampleCount++;
            if(s_CurrSampleCount < adcGroup.streamNumSamples)
            {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
            	currResultBufPtr += adcGroup.numberOfChannels;
#endif
              adcGroup.status->groupStatus = ADC_COMPLETED;
              
              ADC_0.IMR.B.MSKECH = 1;
            }
            else
            {
              /* Sample completed. */
            	adcGroup.status->groupStatus = ADC_STREAM_COMPLETED;

              /* Disable ECH interrupt */
              ADC_0.IMR.B.MSKECH = 0;

              /* Abort conversion */
              ADC_0.MCR.B.ABORTCHAIN = 1;

              /* Disable trigger normal conversions for ADC0 */
              ADC_0.MCR.B.NSTART=0;
            }
        }
        else if(ADC_STREAM_BUFFER_CIRCULAR == adcGroup.streamBufferMode)
        {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
        	static Adc_ValueGroupType *oldResultBufferPtr = 0;
            
            if( s_CurrSampleCount == 0) {
            	oldResultBufferPtr = currResultBufPtr;
            }
#endif
            s_CurrSampleCount++;
            if(s_CurrSampleCount < adcGroup.streamNumSamples)
            {
#ifdef DONT_USE_DMA_IN_ADC_MPC5606S
            	currResultBufPtr += adcGroup.numberOfChannels;
#endif
                if( adcGroup.status->groupStatus != ADC_STREAM_COMPLETED){
                	adcGroup.status->groupStatus = ADC_COMPLETED;
                }
                
