openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc.c
void Adc_DisableGroupNotification (Adc_GroupType group)
{
  AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 0;
}
#endif

#if defined (CFG_MPC5606S)
static void  Adc_ConfigureADC (const Adc_ConfigType *ConfigPtr)
{
  /* Set ADC CLOCK */
  ADC_0.MCR.B.ADCLKSEL = ConfigPtr->hwConfigPtr->adcPrescale;

  ADC_0.DSDR.B.DSD = 254;

  /* Power on ADC */
  ADC_0.MCR.B.PWDN = 0;

  /* Enable DMA. */
  ADC_0.DMAE.B.DMAEN = 1;
}

void Adc_ConfigureADCInterrupts (void)
{
	ISR_INSTALL_ISR2(  "Adc_Err", Adc_ADCError, ADC_ER_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Grp", Adc_Group0ConversionComplete, ADC_EOC_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Wdg", Adc_WatchdogError, ADC_WD_INT,     2, 0 );
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
void Adc_StartGroupConversion (Adc_GroupType group)
{
  uint32 groupChannelIdMask = 0;
    
   /* Run development error check. */
  if (E_OK == Adc_CheckStartGroupConversion (group))
  {    	
    /* Abort conversion, for safety before resetting resultbuffer */
  	ADC_0.MCR.B.ABORTCHAIN = 1;  
  	/* Disable trigger normal conversions for ADC0 */
  	ADC_0.MCR.B.NSTART = 0;

    s_CurrGroupId = group;
    s_CurrSampleCount = 0;

	  currResultBufPtr = AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr; /* Set current result buffer */
#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
   	  Dma_ConfigureChannel ((struct tcd_t *)(AdcConfigPtr->groupConfigPtr[group].groupDMAResults), DMA_ADC_GROUP0_RESULT_CHANNEL);
	  Dma_ConfigureDestinationAddress ((uint32_t)currResultBufPtr, DMA_ADC_GROUP0_RESULT_CHANNEL);
#endif
	  /* Set conversion mode. */
	  ADC_0.MCR.B.MODE = AdcConfigPtr->groupConfigPtr[group].conversionMode;

	  /* Enable Overwrite*/
	  ADC_0.MCR.B.OWREN = 1;

	  /* Set Conversion Time. */
	  ADC_0.CTR[1].B.INPLATCH = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPLATCH;
	  ADC_0.CTR[1].B.INPCMP = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPCMP;
	  ADC_0.CTR[1].B.INPSAMP = AdcConfigPtr->groupConfigPtr[group].adcChannelConvTime.INPSAMP;

	  /* Set group state to BUSY. */
	  AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;

	  for(uint8 i =0; i < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; i++)
	  {
            groupChannelIdMask |= (1 << AdcConfigPtr->groupConfigPtr[group].channelList[i]);
	  }

        /* Enable Normal conversion */
        ADC_0.NCMR[1].R = groupChannelIdMask;

#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
        ADC_0.DMAE.R = 0x01;

        /* Enable DMA Transfer */
        ADC_0.DMAR[1].R = groupChannelIdMask;
#endif

        /* Enable Channel Interrupt */
        ADC_0.CIMR[1].R = groupChannelIdMask;

        /* Enable ECH interrupt */
        ADC_0.IMR.B.MSKECH = 1;

#ifndef DONT_USE_DMA_IN_ADC_MPC5606S
        EDMA.SERQR.R = DMA_ADC_GROUP0_RESULT_CHANNEL;        /* Enable EDMA channel for ADC */

        EDMA.TCD[0].START  = 0;
#endif

        /* Trigger normal conversions for ADC0 */
        ADC_0.MCR.B.NSTART = 1;

        AdcConfigPtr->groupConfigPtr[group].status->isConversionStarted = TRUE;
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}

void Adc_StopGroupConversion (Adc_GroupType group)
{
  if (E_OK == Adc_CheckStopGroupConversion (group))
  {
	/* Abort conversion */
	ADC_0.MCR.B.ABORTCHAIN = 1;

	/* Disable trigger normal conversions for ADC0 */
	ADC_0.MCR.B.NSTART = 0;

	/* Set group state to IDLE. */
	AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

	/* Disable group notification. */
	Adc_DisableGroupNotification (group);
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}
#endif  /* endof #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#else
static void  Adc_ConfigureEQADC (const Adc_ConfigType *ConfigPtr)
{
  Adc_GroupType group;

  enum
  {
    ADC_ENABLE = 0x8000,
  };
  /* Enable ADC0. */
  Adc_WriteEQADCRegister (ADC0_CR, (ADC_ENABLE | ConfigPtr->hwConfigPtr->adcPrescale));

  /* Disable time stamp timer. */
  Adc_WriteEQADCRegister (ADC0_TSCR, 0);

  for (group = ADC_GROUP0; group < ConfigPtr->nbrOfGroups; group++)
  {
    /* Enable eDMA requests for commands and results. */
    EQADC.IDCR[group].B.CFFS = 1;
    EQADC.IDCR[group].B.RFDS = 1;

    /* Invalidate FIFO. */
    EQADC.CFCR[group].B.CFINV = 1;

    /* Enable FIFO fill requests. */
    EQADC.IDCR[group].B.CFFE = 1;
    EQADC.IDCR[group].B.RFDE = 1;
  }
}

void Adc_ConfigureEQADCInterrupts (void)
{
  Adc_GroupType group;

	ISR_INSTALL_ISR2( "Adc_Err", Adc_EQADCError, EQADC_FISR_OVER,     2, 0);
	ISR_INSTALL_ISR2( "Adc_Grp0", Adc_Group0ConversionComplete, EQADC_FISR0_EOQF0,     2, 0);
	ISR_INSTALL_ISR2( "Adc_Grp1", Adc_Group1ConversionComplete, EQADC_FISR1_EOQF1,     2, 0);
  for (group = ADC_GROUP0; group < AdcConfigPtr->nbrOfGroups; group++)
  {
    /* Enable end of queue, queue overflow/underflow interrupts. Clear corresponding flags. */
    EQADC.FISR[group].B.RFOF = 1;
    EQADC.IDCR[group].B.RFOIE = 1;

    EQADC.FISR[group].B.CFUF = 1;
    EQADC.IDCR[group].B.CFUIE = 1;

    EQADC.FISR[group].B.TORF = 1;
    EQADC.IDCR[group].B.TORIE = 1;

    EQADC.FISR[group].B.EOQF = 1;
    EQADC.IDCR[group].B.EOQIE = 1;
  }
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
void Adc_StartGroupConversion (Adc_GroupType group)
{
  /* Run development error check. */
  if (E_OK == Adc_CheckStartGroupConversion (group))
  {
    /* Set conversion mode. */
    EQADC.CFCR[group].B.MODE = AdcConfigPtr->groupConfigPtr[group].conversionMode;

    /* Set single scan enable bit if this group is one shot. */
    if (AdcConfigPtr->groupConfigPtr[group].conversionMode == ADC_CONV_MODE_ONESHOT)
    {
      EQADC.CFCR[group].B.SSE = 1;

      /* Set group state to BUSY. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_BUSY;
    }
  }
  else
  {
    /* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}


#endif
static void Adc_EQADCCalibrationSequence (void)
{
  Adc_ValueGroupType calibrationResult[sizeof(AdcCalibrationCommandQueue)/sizeof(AdcCalibrationCommandQueue[0])];
  int32_t point25Average, point75Average, i;
  Adc_EQADCRegister tempGCC, tempOCC;
  enum
  {
    IDEAL_RES25 = 0x1000,
    IDEAL_RES75 = 0x3000,
  };

  /* Use group 0 DMA channel for calibration. */
  Dma_ConfigureChannel ((struct tcd_t *)&AdcCalibrationDMACommandConfig,DMA_ADC_GROUP0_COMMAND_CHANNEL);
  Dma_ConfigureChannelTranferSize (sizeof(AdcCalibrationCommandQueue)/sizeof(AdcCalibrationCommandQueue[0]),
		                           DMA_ADC_GROUP0_COMMAND_CHANNEL);
  Dma_ConfigureChannelSourceCorr (-sizeof(AdcCalibrationCommandQueue), DMA_ADC_GROUP0_COMMAND_CHANNEL);

  Dma_ConfigureChannel ((struct tcd_t *)&AdcCalibrationDMAResultConfig, DMA_ADC_GROUP0_RESULT_CHANNEL);
  Dma_ConfigureChannelTranferSize (sizeof(calibrationResult)/sizeof(calibrationResult[0]),
		                           DMA_ADC_GROUP0_RESULT_CHANNEL);
  Dma_ConfigureChannelDestinationCorr (-sizeof(calibrationResult), DMA_ADC_GROUP0_RESULT_CHANNEL);
  Dma_ConfigureDestinationAddress ((uint32_t)calibrationResult, DMA_ADC_GROUP0_RESULT_CHANNEL);

  /* Invalidate queues. */
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.CFINV = 1;

  Dma_StartChannel (DMA_ADC_GROUP0_COMMAND_CHANNEL);
  Dma_StartChannel (DMA_ADC_GROUP0_RESULT_CHANNEL);

  /* Start conversion. */
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.MODE = ADC_CONV_MODE_ONESHOT;
  EQADC.CFCR[ADC_EQADC_QUEUE_0].B.SSE = 1;

  /* Wait for conversion to complete. */
  while(!Dma_ChannelDone (DMA_ADC_GROUP0_RESULT_CHANNEL))
  {
    ;
  }

